Repository: WatheqAlshowaiter/ebloodbank
Catalog: app/locales/*.po
Languages: ar

source: City added.
ar: تم إضافة المدينة.

source: Please enter a unique city name.
ar: يرجى إدخال اسم فريد للمدينة.

source: District added.
ar: تم إضافة المديرية.

source: Donor added.
ar: تم إضافة المتبرع.

source: [%s] New Donor
ar: [%s] متبرع جديد

source: New donor addition on %s:
ar: إضافة متبرع جديد على %s:

source: Name: %s
ar: الاسم: %s

source: Gender: %s
ar: الجنس: %s

source: Blood Group: %s
ar: فصيلة الدم: %s

source: City\District: %1$s\%2$s
ar: المدينة/المديرية: %1$s/%2$s

source: User added.
ar: تم إضافة المستخدم.

source: Please enter a unique user e-mail.
ar: يرجى إدخال بريد إلكتروني فريد للمستخدم.

source: Please enter the password.
ar: يرجى إدخال كلمة المرور.

source: Please confirm the password.
ar: يرجى تأكيد كلمة المرور.

source: Please enter the same password.
ar: يرجى إدخال نفس كلمة المرور.

source: At first, delete any linked districts with this city.
ar: في البداية، احذف أي مديريات مرتبطة مع هذه المدينة.

source: At first, delete any linked donors with this district.
ar: في البداية، احذف أي متبرعين مرتبطين مع هذه المديرية.

source: %d city permanently deleted.
ar: لم يتم حذف أي مدينة بشكل دائم.

source: City edited.
ar: تم تحرير المدينة.

source: District edited.
ar: تم تحرير المديرية.

source: %d district permanently deleted.
ar: لم يتم حذف أي مديرية بشكل دائم.

source: Donor edited.
ar: تم تحرير المتبرع.

source: %d donor approved.
ar: لم تتم الموافقة على أي متبرع.

source: %d donor permanently deleted.
ar: لم يتم حذف أي متبرع بشكل دائم.

source: User edited.
ar: تم تحرير المستخدم.

source: Please enter the password twice.
ar: يرجى إدخال كلمة المرور مرتين.

source: %d user activated.
ar: لم يتم تفعيل أي مستخدم.

source: %d user permanently deleted.
ar: لم يتم حذف أي مستخدم بشكل دائم.

source: Please enter your password.
ar: يرجى إدخال كلمة مرورك

source: Please confirm your password.
ar: يرجى تأكييد كلمة مرورك

source: An unexpected error occurred while installing eBloodBank.
ar: حدث خطأ غير متوقع أثناء تنصيب eBloodBank.

source: You are now logged out.
ar: تم الآن تسجيل خروجك.

source: Please enter your login details.
ar: يرجى إدخال بيانات تسجيل الدخول الخاصة بك.

source: No match for user e-mail and/or password.
ar: لا تطابق لمستخدم بالبريد الإلكتروني و/أو كلمة المرور.

source: Your account is pending moderation.
ar: حسابك بانتظار الموافقة.

source: Settings saved.
ar: تم حفظ الإعدادات.

source: Please enter another e-mail address.
ar: يرجى إدخال عنوان بريد إلكتروني آخر.

source: [%s] New User Registration
ar: [%s] تسجيل مستخدم جديد

source: New user registration on %s:
ar: تسجيل مستخدم جديد على %s:

source: Username: %s
ar: اسم المستخدم: %s

source: E-mail: %s
ar: البريد الإلكتروني: %s:

source: Invalid locale code.
ar: رمز اللغة غير صالح.

source: Locale MO file is not readable or not exists.
ar: ملف الـ MO الخاص باللغة غير قابل للقراءة أو غير موجود.

source: Locale PO file is not readable or not exists.
ar: ملف الـ PO الخاص باللغة غير قابل للقراءة أو غير موجود.

source: Subscriber
ar: مشترك

source: Contributor
ar: مساهم

source: Editor
ar: محرر

source: Administrator
ar: مدير

source: Invalid city ID.
ar: الرقم المعرف للمدينة غير صالح.

source: Invalid city name.
ar: اسم المدينة غير صالح.

source: Invalid city originator.
ar: مُنشئ المدينة غير صالح.

source: Invalid district ID.
ar: الرقم المعرف للمديرية غير صالح.

source: Invalid district name.
ar: اسم المديرية غير صالح.

source: Invalid district city.
ar: مدينة المديرية غير صالحة.

source: Invalid district originator.
ar: مُنشئ المديرية غير صالح.

source: Male
ar: ذكر

source: Female
ar: أنثى

source: Invalid donor ID.
ar: الرقم المعرف للمتبرع غير صالح.

source: Invalid donor name.
ar: اسم المتبرع غير صالح.

source: Invalid donor gender.
ar: جنس المتبرع غير صالح.

source: Invalid donor blood group.
ar: فصيلة دم المتبرع غير صالحة.

source: Invalid donor district.
ar: مديرية المتبرع غير صالحة.

source: Invalid donor originator.
ar: مُنشئ المتبرع غير صالح.

source: Invalid donor status.
ar: حالة المتبرع غير صالحة.

source: Invalid donor weight.
ar: وزن المتبرع غير صالح.

source: Invalid donor e-mail.
ar: البريد الإلكتروني للمتبرع غير صالح.

source: Invalid donor phone number.
ar: رقم هاتف المتبرع غير صالح.

source: Invalid user ID.
ar: الرقم المعرف للمستخدم غير صالح.

source: Invalid user name.
ar: اسم المستخدم غير صالح.

source: Invalid user e-mail.
ar: البريد الإلكتروني للمستخدم غير صالح.

source: Invalid user password.
ar: كلمة مرور المستخدم غير صالحة.

source: Invalid user role.
ar: رتبة المستخدم غير صالحة.

source: Invalid user status.
ar: حالة المستخدم غير صالحة.

source: Invalid variable name.
ar: اسم المتغير غير صالح.

source: Invalid site URL.
ar: رابط الموقع غير صالح.

source: Invalid site name.
ar: اسم الموقع غير صالح.

source: Invalid site locale.
ar: لغة الموقع غير صالحة.

source: Invalid site e-mail address.
ar: عنوان البريد الإلكتروني للموقع غير صالحة.

source: Invalid self-registration status.
ar: حالة التسجيل-الذاتي غير صالحة.

source: Invalid new user role.
ar: رتبة المستخدم الجديد غير صالحة.

source: Invalid new user status.
ar: حالة المستخدم الجديد غير صالحة.

source: Invalid entities per page count.
ar: عدد الكيانات في الصفحة الواحدة غير صالح.

source: Activate User
ar: تفعيل مستخدم

source: Activate user "%s"?
ar: تفعيل المستخدم "%s"؟

source: Activate
ar: تفعيل

source: Add New City
ar: أضف مدينة جديدة

source: Add New District
ar: أضف مديرية جديدة

source: Add New Donor
ar: أضف متبرع جديد

source: Add New User
ar: أضف مستخدم جديد

source: Approve Donor
ar: الموافقة على متبرع

source: Approve donor "%s"?
ar: الموافقة على المتبرع "%s"؟

source: Approve
ar: وافق

source: Delete City
ar: حذف مدينة

source: Delete city "%s"?
ar: حذف المدينة "%s"؟

source: Delete
ar: حذف

source: Delete District
ar: حذف مديرية

source: Delete district "%s"?
ar: حذف المديرية "%s"؟

source: Delete Donor
ar: حذف متبرع

source: Delete donor "%s"?
ar: حذف المتبرع "%s"؟

source: Delete User
ar: حذف مستخدم

source: Delete user "%s"?
ar: حذف المستخدم "%s"؟

source: Edit Cities
ar: تحرير المدن

source: View
ar: عرض

source: Add New
ar: أضف جديد

source: Name
ar: الاسم

source: Actions
ar: الإجراءات

source: Edit City
ar: تحرير المدينة

source: Edit District
ar: تحرير المديرية

source: Edit Districts
ar: تحرير المديريات

source: City
ar: المدينة

source: Edit Donor
ar: تحرير المتبرع

source: Edit Donors
ar: تحرير المتبرعين

source: Gender
ar: الجنس

source: Age
ar: العمر

source: Blood Group
ar: فصيلة الدم

source: District
ar: المديرية

source: Pending
ar: بإنتظار الموافقة

source: Edit User
ar: تحرير المستخدم

source: Edit Users
ar: تحرير المستخدمين

source: E-mail
ar: البريد الإلكتروني

source: Role
ar: الرتبة

source: Error: Access denied
ar: خطأ: تم رفض الوصول

source: Sorry, you are not authorized to access this page.
ar: المعذرة، أنت غير مصرح لك بالوصول إلى هذه الصفحة.

source: Error: Not Found
ar: خطأ: غير موجود

source: Sorry, the page you requested was not found.
ar: المعذرة، الصفحة التي طلبتها غير موجودة.

# language code
source: en
ar: ar

# text direction
source: ltr
ar: rtl

source: eBloodBank &rsaquo; Database Error
ar: eBloodBank &rsaquo; خطأ في قاعدة البيانات

source: Error: Database Connection Failed
ar: خطأ: فشل الاتصال بقاعدة البيانات.

source: An error occurred while establishing the database connection.
ar: حدث خطأ أثناء الاتصال بقاعدة البيانات.

source: Submit
ar: إرسال

source: Birthdate
ar: تاريخ الميلاد

source: Weight (kg)
ar: الوزن (كجم)

source: Phone
ar: الهاتف

source: Address
ar: العنوان

source: All
ar: الكل

source: Search
ar: بحث

source: Password
ar: كلمة المرور

source: Log In
ar: تسجيل الدخول

source: Type your password
ar: أكتب كلمة مرورك

source: Type your password again
ar: أكتب كلمة مرورك مرة أخرى

source: Sign Up
ar: التسجيل

source: New Password
ar: كلمة المرور الجديدة

source: Type the password
ar: أكتب كلمة المرور

source: Type the password again
ar: أكتب كلمة المرور مرة أخرى

source: Toggle navigation
ar: تبديل التنقل

source: Home
ar: الرئيسية

source: Donors
ar: المتبرعين

source: Cities
ar: المدن

source: Districts
ar: المديريات

source: Users
ar: المستخدمين

source: Settings
ar: الإعدادات

source: Hello, <b>%s</b>!
ar: مرحبًا، <b>%s</b>!

source: Anonymous, Log In?
ar: مجهول، تسجيل الدخول؟

source: Hello, life savers!
ar: مرحبًا، منقذو الحياة!

source: Blood transfusion helps save millions of lives every year. Optimistically, we will help to save more.
ar: نقل الدم يساعد على إنقاذ حياة ملايين الأشخاص كل عام. بتفائل، نحن سنساعد على إنقاذ المزيد.

source: Add Donor
ar: أضف متبرع

source: Add City
ar: أضف مدينة

source: Add District
ar: أضف مديرية

source: Add User
ar: أضف مستخدم

source: eBloodBank &rsaquo; Installation
ar: eBloodBank &rsaquo; التنصيب

source: Configuration
ar: الإعدادات

source: Welcome to eBloodBank, Before getting started, we need some information on the database. You will need to know the following items before proceeding.
ar: مرحبًا بك في eBloodBank، قبل الشروع في العمل، نحن بحاجة لبعض المعلومات عن قاعدة البيانات. عليك معرفة العناصر التالية قبل المتابعة.

source: Database name
ar: اسم قاعدة البيانات

source: Database username
ar: اسم مستخدم قاعدة البيانات

source: Database password
ar: كلمة مرور قاعدة البيانات

source: Database host
ar: مُضيف قاعدة البيانات

source: We’re going to use this information to setup the database. You should open "app/config.php" file in a text editor, fill in your information, and save it.
ar: نحن في طريقنا لاستخدام هذه المعلومات لإعداد قاعدة البيانات. يجب عليك فتح ملف <code>app/config.php</code> بواسطة محرّر نصوص، ثمّ ملئه بالمعلومات الخاصة بك، ومن ثمّ حفظ الملف.

source: Run the install
ar: شغل معالج التنصيب

source: Installation
ar: التنصيب

source: Welcome to the installation process! Just fill in the information below and you’ll be on your way to using the eBloodBank premium system.
ar: مرحبًا بك في معالج التنصيب! فقط قم بملء المعلومات المطلوبة أدناه لتصبح على طريقك في استخدام نظام eBloodBank المُمتاز.

source: Site Information
ar: معلومات الموقع

source: Site Name
ar: اسم الموقع

source: Site E-mail
ar: بريد الموقع الإلكتروني

source: Administrator Account
ar: حساب المدير

source: Install eBloodBank
ar: تنصيب eBloodBank

source: Already Installed
ar: منصب بالفعل

source: You have already installed eBloodBank.
ar: لقد قمت بتنصيب eBloodBank بالفعل.

source: Site Options
ar: خيارات الموقع

source: Site URL
ar: رابط الموقع

source: Site Slogan
ar: شعار الموقع

source: Site Locale
ar: لغة الموقع

source: Users Options
ar: خيارات المستخدمين

source: Enable self-registration.
ar: تمكين التسجيل-الذاتي.

source: New User Role
ar: رتبة المستخدم الجديد

source: New User Status
ar: حالة المستخدم الجديد

source: Activated
ar: مُفعل

source: Reading Options
ar: خيارات القراءة

source: Entities Per Page
ar: عدد الكيانات لكل صفحة

source: Save Settings
ar: حفظ الإعدادات

source: Edit
ar: تحرير

source: City\District
ar: المدينة/المديرية

source: Log Out
ar: تسجيل الخروج

source: Add
ar: إضافة
